<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"test-plan colours","backend":"a78d8700b0256dca3e65192d2a60ed843e4f49084207b22e834fcbe1217bfdd0","plan_job_ref":"Job Test terraform-plan #792 at https://github.com/dflook/terraform-github-actions/actions/runs/20958395553","plan_out_hash":"fe6bf58648372edb16b19ec3918daadc719645f23b0a3b92034f4d9a2d8f589d","plan_hash":"553fdfaaa2a3f7dd49f3e34045be2ff6fd68d55d3e79a72d654cdf0381423db2","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan for __test-plan colours__
<details>
<summary>Plan: 3 to add, 1 to change, 3 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_s3_object.update will be updated in-place
!~  resource "aws_s3_object" "update" {
!~      content                = "hello" -> "update"
        id                     = "test-plan-colours-test-object"
        tags                   = {}
+       version_id             = (known after apply)
#        (12 unchanged attributes hidden)
    }

  # random_string.add[0] will be created
+   resource "random_string" "add" {
+       id          = (known after apply)
+       length      = 3
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = true
+       upper       = true
    }

  # random_string.create_before_delete must be replaced
+/- resource "random_string" "create_before_delete" {
!~      id          = "****" -> (known after apply)
!~      length      = 4 -> 3 # forces replacement
!~      result      = "****" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # random_string.delete[0] will be destroyed
  # (because index [0] is out of range for count)
-   resource "random_string" "delete" {
-       id          = "02g" -> null
-       length      = 3 -> null
-       lower       = true -> null
-       min_lower   = 0 -> null
-       min_numeric = 0 -> null
-       min_special = 0 -> null
-       min_upper   = 0 -> null
-       number      = true -> null
-       numeric     = true -> null
-       result      = "02g" -> null
-       special     = true -> null
-       upper       = true -> null
    }

  # random_string.delete_before_create must be replaced
-/+ resource "random_string" "delete_before_create" {
!~      id          = "***" -> (known after apply)
!~      length      = 3 -> 4 # forces replacement
!~      result      = "***" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
+   add    = "hello"
-   delete = "goodbye" -> null
!~  update = "hello" -> "update"
```
</details>

:memo: Plan generated in [Test terraform-plan #792](https://github.com/dflook/terraform-github-actions/actions/runs/20958395553)